{
  "easy": [
    "The sun rises in the east.",
    "I love typing simple sentences.",
    "Practice makes perfect every day.",
    "Typing fast takes time and patience.",
    "Cats love to sleep on warm beds.",
    "My brother likes to play football.",
    "Rainy days make me want to read books.",
    "I enjoy learning new skills online.",
    "We all need water to stay alive.",
    "This is a basic typing test sentence.",
    "The sky is blue and full of clouds.",
    "I like to drink coffee in the morning.",
    "She walks her dog every afternoon.",
    "Typing slowly helps you reduce errors.",
    "The teacher asked us to write neatly.",
    "A good meal makes everyone happy.",
    "My favorite color is blue.",
    "I keep my desk clean and tidy.",
    "Every day is a chance to improve.",
    "The bird sings outside my window.",
    "He drives carefully through traffic.",
    "I forgot my umbrella at home today.",
    "The stars shine brightly at night.",
    "They play music in the park.",
    "I’m happy to be learning this skill.",
    "Typing is fun when you get used to it.",
    "My computer keyboard is very soft.",
    "Let’s go for a short walk together.",
    "I will call you when I get home.",
    "She made a cake for her best friend.",
    "I like to listen to calm music.",
    "Reading books helps improve focus.",
    "I brush my teeth every morning.",
    "Learning is better with consistency.",
    "This typing game helps me relax.",
    "He likes to paint during the weekend.",
    "We enjoy watching movies on Fridays.",
    "My little sister is very curious.",
    "Typing challenges help build confidence.",
    "Good posture helps prevent back pain.",
    "I will finish this task before lunch.",
    "She practices her typing every night.",
    "My keyboard lights up in the dark.",
    "Typing can be both fun and productive.",
    "Always check your spelling before submitting.",
    "A quick nap makes me feel refreshed.",
    "I drink a glass of water every hour.",
    "He reads the newspaper every morning.",
    "We cook dinner together on Sundays.",
    "Typing speed improves with practice.",
    "I enjoy spending time with my family."
  ],
  "medium": [
    "Typing requires a mix of speed and accuracy to be efficient.",
    "Many programmers type hundreds of lines of code every day.",
    "Developing good typing habits improves productivity significantly.",
    "When learning to type, focus on accuracy before speed.",
    "The best way to master typing is through regular daily practice.",
    "Touch typing means typing without looking at the keyboard.",
    "Your fingers should rest naturally on the home row keys.",
    "Typing tests measure both your speed and your accuracy rate.",
    "Online typing platforms provide exercises for all levels.",
    "Consistency is more important than speed at the beginning.",
    "Gamified typing lessons help learners stay motivated longer.",
    "Small typing mistakes can slow down your overall speed.",
    "Try to maintain a calm rhythm while typing paragraphs.",
    "Typing competitions challenge your focus and reaction time.",
    "It’s important to sit straight to avoid wrist strain.",
    "A clean keyboard helps prevent dust buildup and errors.",
    "Typing quotes from books is a fun way to practice.",
    "Writers use typing tools to improve their creative flow.",
    "Always review your results after completing a typing test.",
    "The faster you type, the more efficient your workflow becomes.",
    "Typing accuracy is measured by the number of correct characters.",
    "Music can help some people type faster by improving focus.",
    "A slow typist can still outperform a fast one with better accuracy.",
    "Typing on different devices can affect your finger placement.",
    "Professional typists often exceed one hundred words per minute.",
    "Learning keyboard shortcuts saves a lot of time daily.",
    "Don’t panic when you make a typing mistake; just keep going.",
    "Typing is one of the most essential computer skills today.",
    "Each hand covers half the keyboard in proper typing posture.",
    "Keep your wrists slightly raised for comfortable typing.",
    "Typing paragraphs instead of words builds endurance.",
    "Tracking your typing progress helps you see improvement.",
    "Every typist starts slow before becoming faster with practice.",
    "Typing games make learning feel less like a chore.",
    "Some people learn typing by copying lyrics or poems.",
    "Maintaining good accuracy should always be your main goal.",
    "A cluttered workspace can reduce typing performance.",
    "Typing warm-ups prepare your fingers for long sessions.",
    "Many offices require employees to take typing assessments.",
    "Good lighting reduces eye strain during long typing sessions.",
    "Typing with the correct hand positions prevents fatigue.",
    "Short breaks between typing tests refresh your mind.",
    "Your posture directly affects how long you can type comfortably.",
    "Frequent typing can improve spelling and grammar subconsciously.",
    "Use proper finger placement to minimize unnecessary movement.",
    "Speed typing contests are fun ways to test your skills.",
    "Typing rhythm improves naturally over time with practice.",
    "People who type daily often notice faster thinking patterns.",
    "Typing faster can boost confidence in digital communication.",
    "Each completed test brings you one step closer to mastery."
  ],
  "hard": [
    "Typing long sentences accurately demands both patience and mental discipline.",
    "Advanced typists develop muscle memory that allows near-perfect rhythm.",
    "Errors in longer passages often occur from misplaced focus rather than speed.",
    "When typing complex texts, consistency outweighs aggressive pacing every time.",
    "Professionals practice typing using real-world materials such as reports or essays.",
    "Finger precision becomes essential during extended typing sessions with little rest.",
    "True mastery of typing requires balancing momentum with thoughtful correction.",
    "Typing intricate sentences trains both mental endurance and finger flexibility.",
    "A skilled typist maintains an even tempo regardless of sentence complexity.",
    "Typing academic or legal content requires attention to punctuation and format.",
    "Long-form typing tasks challenge your ability to maintain mental clarity.",
    "Typing fluency enhances digital literacy and overall communication efficiency.",
    "Proper hand ergonomics can prevent repetitive strain injuries during typing marathons.",
    "Some writers practice typing blindfolded to strengthen spatial finger awareness.",
    "Discipline, focus, and posture are key elements of high-level typing performance.",
    "Typing while multitasking can lead to both cognitive and physical exhaustion.",
    "Veteran typists often describe their skill as a form of synchronized rhythm.",
    "Typing difficult words repetitively helps build advanced muscle memory.",
    "A quiet, distraction-free environment improves typing flow and precision.",
    "Complex punctuation and special characters add an extra challenge to speed typing.",
    "High-level typists train using long paragraphs filled with varied vocabulary.",
    "Maintaining focus over extended periods defines the best professional typists.",
    "Typing reports and essays demands grammatical awareness in real-time.",
    "Long sentences test your endurance far more than short bursts of typing.",
    "The best typists combine accuracy, comfort, and rhythm into one smooth motion.",
    "Typing at high speeds without looking requires extreme mental mapping ability.",
    "Elite typists rarely hit random keys, as each motion is intentional and refined.",
    "Typing detailed passages helps build both accuracy and pattern retention.",
    "Serious typists analyze finger travel distance to reduce unnecessary effort.",
    "Even minor distractions can lead to major typing inconsistencies.",
    "Typing continuous text forces your brain into a deep state of focus.",
    "Every typist eventually finds a personal rhythm suited to their mind and hands.",
    "Fluent typists can transcribe thoughts into words almost instantaneously.",
    "Typing precision improves dramatically through deliberate slow practice.",
    "Advanced practice involves transcribing complex literature or code syntax.",
    "Master typists focus on stability rather than breaking speed records.",
    "A steady breathing pattern helps sustain long periods of typing concentration.",
    "Typing professionally demands adaptability across various content types.",
    "Expert typists rarely think about the keyboard—they think about ideas instead.",
    "Typing speed beyond one hundred words per minute requires exceptional training.",
    "The most accurate typists treat each test as a form of meditation.",
    "Typing in silence allows maximum auditory concentration and focus.",
    "Improper desk height can slow typing and cause shoulder tension.",
    "High-speed typists often rely on rhythmic background music to stay consistent.",
    "Typing dense paragraphs challenges your endurance and memory recall.",
    "Professional typists optimize workspace ergonomics for efficiency and comfort.",
    "The discipline of typing well reflects patience, rhythm, and technical mastery.",
    "Perfect typing form is achieved only after years of consistent, mindful practice.",
    "Typing is not merely mechanical—it’s a dance of rhythm and precision."
  ]
}
