{
  "beginner": {
    "title": "Beginner",
    "description": "Shorter long-form passages to build rhythm and accuracy; designed to be accessible for newcomers. Focus on consistent typing and low error-rate.",
    "reward": "Access to beginner multiplayer pool",
    "next": "intermediate",
    "requirement": { "wins_needed": 3, "min_wpm": 30 },
    "sentences": [
      "Typing is like learning to play a musical instrument. At first the hands move slowly and uncertainly across the keys, but with repetition the fingers learn the most efficient path. This passage is designed to be long enough to build endurance, yet written using straightforward vocabulary and sentences that are easy to parse. The goal is to let your fingers move comfortably while you focus on accuracy. Keep your wrists relaxed; keep breathing in a calm rhythm. Read ahead a few words at a time rather than trying to process the whole sentence at once. If you miss a letter, keep going: correcting on the fly trains recovery as much as accuracy. Over many runs you will feel your rhythm smoothing out — words will stop needing conscious thought and the movement will become natural. This beginner passage includes some commas and parentheses, but avoids dense punctuation like em dashes or nested quotations. Build confidence here; every steady run is progress toward faster, more confident typing.",
      "This paragraph gives you the space to develop muscle memory without overwhelming punctuation or unexpected vocabulary. Practice the transitions between common letter combinations and pay attention to your posture; small ergonomic improvements make big differences over time. Imagine the keyboard as a set of keys on a piano and your fingers as the players: you are training them to find the right keys, even when your brain is thinking two steps ahead. This exercise emphasizes short phrases linked by commas and gentle clause structure. As you get comfortable, aim to maintain a steady pace and minimize backspaces. The fewer pauses you introduce into your typing, the more your overall words-per-minute will climb naturally. The beginner pool is forgiving, but it rewards rhythm and steady progress.",
      "In these early matches, accuracy powers your evolution. The content here is purposely clear and descriptive so you can keep concentration on letter sequences rather than obscure vocabulary. When you race against others in this level, aim to type with confidence and let your fingers lead when your eyes catch the next word. Recovery — the ability to continue typing after an error — is a cornerstone skill that this passage helps you cultivate. Focus on consistent finger landing and light keystrokes, keeping the hands relaxed and shoulders down. Over repeated beginner runs you'll notice patterns in the most frequent mistakes; target those patterns in practice sessions. The beginner level gives you generous run length to develop endurance, so treat each passage like a short endurance interval for your typing muscles.",
      "This passage uses straightforward language and moderate sentence length so that new multiplayer players can compete fairly without being overwhelmed. It teaches you to handle mildly complex punctuation—commas and a few parentheses—while keeping the cadence manageable. Work on minimizing hesitation and reading ahead by at least three to five words; that simple habit is the single biggest improvement for intermediate speed gains. Try to maintain an even tempo and resist the urge to 'sprint' early in the text; too many initial errors will cost more time than a steady, slightly slower start. Let each paragraph be an opportunity to smooth out your typing rhythm and reduce the total number of backspaces.",
      "Beginner passages are intentionally friendly: vocabulary is frequent and predictable, and punctuation is limited. This final sample in the beginner pool encourages mental pacing—breathing and finger motion that match one another. When you race, consider every error as informative: note where your fingers tend to slip and adapt your practice to address that exact transition. Beginners who succeed most often are those who prioritize fewer mistakes over short-term speed; the long-term result is a faster, more reliable performance. Take the time to complete each passage and treat your finish as a checkpoint. Over weeks, the beginner pool's repeated structure will transform hesitance into fluent motion and set the stage for the more demanding passages ahead."
    ]
  },

  "intermediate": {
    "title": "Intermediate",
    "description": "Longer paragraphs and increased punctuation complexity. This pool adds more commas, semicolons, and mixed clause structure to strengthen endurance and control.",
    "reward": "Access to intermediate multiplayer pool and intermediate analytics",
    "next": "advanced",
    "requirement": { "wins_needed": 3, "min_wpm": 50 },
    "sentences": [
      "At the intermediate level the passages widen to contain longer sentence structures, compound phrases, and a careful use of semicolons to create musical rhythm. This gives you the opportunity to practice transitions between multi-word clusters and to anticipate punctuation while maintaining speed. The content contains a mix of narrative imagery and practical advice, giving your brain both predictable parts and slight surprises to keep attention sharp. Build reading-ahead habits and use subtle finger patterns for letter pairs that repeat; you'll start to notice which digraphs require extra attention. Pressure testing under race conditions here helps you learn the difference between comfortable speed and risky haste. Focus on maintaining circulation—short breaks between sessions prevent fatigue—so when you step into a multiplayer match you bring both endurance and focused clarity.",
      "Intermediate passages present an interesting balance: they are long enough to test stamina but still constructed with mostly common vocabulary. You will encounter semicolons and parenthetical clauses that test your ability to continue a phrase gracefully without breaking your typing flow. The passage may include direct quotes or descriptive em dashes that require a momentary mental shift; these are excellent for improving punctuation handling because they simulate real writing. Try to keep your speed steady and deliberate. If you find your accuracy dipping in a particular clause, slow momentarily and regain control — the time lost is usually less than the time lost by fixing multiple mistakes later. This skill is what distinguishes intermediate typists from beginners.",
      "The goal at this level is to fuse accuracy with longer sustained typing, and these passages are crafted to encourage that fusion. They include parallel clauses, repeated structures for rhythm practice, and moderate punctuation density. Reading ahead multiple words is crucial; consider the whole phrase structure instead of individual words. In multiplayer contests, maintaining composure during punctuation or unusual phrasing will give you an advantage, because many competitors slow at those exact spots. Strengthen your ability to recover after the occasional mistake and train to keep the hands moving. Over repeated sessions, the intermediate pool should noticeably increase your average sustained WPM while solidifying lower error rates.",
      "This entry further increases complexity by layering clauses and introducing a few less-common punctuation forms—all still within an accessible vocabulary set. The idea is to expose you to the types of sentence structure you’ll often see in real-world text while keeping the passages coherent and interesting to type. Work through these with consistent cadence, avoid sudden bursts of speed that produce errors, and pay attention to small ergonomic cues: relaxed shoulders, light fingertip strikes, and an even rhythm. These practical habits support higher performance as you chase the thresholds for the advanced level.",
      "Intermediate passages are a transition zone: they train endurance and punctuation handling while still ensuring that all players have a fair chance in multiplayer races. The cumulative practice here will sharpen reading-ahead, punctuation anticipation, and phrase-based typing. When competing, you'll want to lean on these practiced habits and stay attentive for commas and semicolons that often break tempo. Each successful run in the intermediate pool builds the foundation required to handle the longer, punctuation-rich advanced passages."
    ]
  },

  "advanced": {
    "title": "Advanced",
    "description": "Long-form passages with dense punctuation patterns, advanced clause structures, and occasional dialogue. This level trains precision in chaos and sustained high-speed typing.",
    "reward": "Access to advanced multiplayer pool and leaderboard rewards",
    "next": "expert",
    "requirement": { "wins_needed": 3, "min_wpm": 60 },
    "sentences": [
      "Advanced passages demand both stamina and precision. Here, paragraphs stretch extensively and weave through multiple clauses—some linked by commas, others separated by semicolons, and still others with parenthetical ideas that interrupt the main flow. The result is a thorough test of your ability to keep a steady rhythm while negotiating punctuation and phrasing that would unsettle a less-practiced typist. Some lines may have quoted speech or hyphenated sequences, which require extra attention to special characters. Race strategy at this level involves careful pacing: sprinting early typically causes backspaces that slow you more than a steady, accurate pace. Advanced typists learn to pace themselves inside each paragraph and to keep the hands moving when textual complexity appears. This pool is ideal for practicing the kind of text you'd find in long-form articles, essays, or technical explanations.",
      "This passage blends narrative with formal exposition, moving from direct statements to reflective asides and returning again to a primary thought. The punctuation density is higher here—commas, colons, and semicolons appear frequently and without warning, meaning your ability to read ahead and anticipate clauses will directly impact your speed. Dialogue or quoted passages may require toggling between capitalization and punctuation rules quickly, and you’ll practice that without pause in race conditions. By repeatedly training on these constructs, you'll develop an internal sense of timing that makes complex punctuation second nature.",
      "At the advanced level, long sentences form rhythmic arcs that demand sustained concentration. Errors in one clause can cascade into the next, so recovery is a critical skill; training to calmly keep typing through a mistake, then correct, is essential. You'll see lists separated by semicolons, parenthetical explanations nested into sentences, and the occasional dash that changes the cadence. The best approach is to read a phrase ahead and place your fingers in a quasi-predictive posture—anticipating the next cluster of letters rather than reacting to each letter individually. Advanced multiplayer races often split on a handful of key punctuation points, so practice there is high-value.",
      "This selection is intentionally dense: it simulates long editorial paragraphs and technical explanations that typists may encounter in real life. The passage is helpful for building the kind of high-fidelity typing where both speed and near-perfect accuracy are expected. Brevity gives way to complexity; endurance pairs with attention to detail. Competitors who master these passages often have excellent error-recovery habits and an ability to maintain momentum. If you can race through these with few backspaces, you'll find yourself consistently near the top of advanced leaderboards.",
      "The advanced pool also includes passages that demand attention to capitalization patterns, bracketed asides, and nested parenthetical elements. When you compete, a key advantage arises from anticipating punctuation and preparing your fingers for the next word cluster before you arrive there. This predictive typing breaks down the paragraph into manageable chunks and helps maintain continuous motion—exactly what this level rewards. The more you practice these structures, the more the keyboard feels like an extension of your expression; the movements become precise, fast, and confident."
    ]
  },

  "expert": {
    "title": "Expert",
    "description": "Elite-level, marathon-length paragraphs with dense punctuation, nested clauses, and unpredictable phrasing. Expert passages require concentration, stamina, and exceptional accuracy.",
    "reward": "Access to the expert multiplayer pool, elite leaderboard placement, and special challenges (Premium Plus only).",
    "next": null,
    "requirement": { "wins_needed": 4, "min_wpm": 85 },
    "sentences": [
      "Expert passages are substantial essays in miniature, composed to tax both memory and dexterity. Expect long paragraphs in which clauses wind into one another, punctuation appears without warning, and dialog or quoted excerpts interleave with expository text. There are parenthetical remarks, em dashes used for emphasis, and series of short phrases that interrupt a longer thought. The objective is to force mental discipline: to maintain speed while parsing structural complexity. In a multiplayer race, the expert passage separates those who have trained to think in phrases and those who still think one letter at a time. This material is not merely about vocabulary; it's about rhythm, punctuation anticipation, and the ability to recover quickly from errors without losing the thread of thought. Over long practice sessions the best typists become capable of scanning several words ahead and placing their hands in a predictive manner, minimizing the need for corrective motions.",
      "This particular passage contains sections that mimic academic writing, followed by anecdotal recollections and a short quoted exchange within the flow of commentary. Such mixtures of style are the hallmark of expert text: they test your ability to switch context without losing speed. It will challenge your capitalization habits, your punctuation reflexes, and your ability to maintain focus over many lines. The best strategy is to maintain soft keystrokes, read ahead frequently, and handle punctuation characters with calm rather than panic. The expert level rewards those who have cultivated ergonomics, focused practice, and a habit of immediate recovery after a mistake.",
      "Expert texts often include lists, nested ideas, and rhetorical flourishes—each of which requires compromises in speed to retain accuracy. Competitions at this level become marathons of concentration. Where earlier levels demanded an average rhythm and accuracy, the expert pool expects you to synthesize all previous skills into extended performance. To train for this, aim to break the paragraph into logical chunks and treat each chunk as a short sprint; after each sprint, regain composure and begin the next with the same calm precision. Doing so repeatedly builds the neural pathways that support professional-level typing.",
      "These expert passages simulate the kinds of texts where real-world writers spend entire paragraphs establishing nuance: press quotes that use nested punctuation, descriptive sequences that call for precise capitalization, and parentheses that require quick alternation between letters and symbols. When you race in this pool, cultivate a quiet mind: distractions will cost more here than anywhere else because the passage does not forgive multiple corrections. Instead, rely on your practiced recovery techniques and a consistent midline that keeps your hands centered on the keyboard.",
      "The final expert sample in this pool intentionally blends several styles—narrative, expository, and quoted dialogue—so that the typist must constantly shift mental posture. This is the crucible of true expertise: maintaining pace through style changes, punctuation richness, and density of information. Only those who have practiced a wide variety of texts will feel at home here; the rest will find themselves slowed by the unpredictable turns in sentence structure. The expert pool is reserved for players who have already demonstrated both speed and consistent accuracy over multiple matches, and on Premium Plus it becomes the proving ground for elite leaderboard placement."
    ]
  }
}
